import React from "react";
import {H2} from "../../common/heading";

function IndentP({children}) {
    return <p>
        &emsp;&emsp;
        {children}
    </p>
}

function SplitHorizontai() {
    return <div style={{width: "100%", height: 1, background: "grey"}}></div>
}

/**
 * 裁裁例文
 * @constructor
 */
export function SampleArticle() {
    return <div>

        <H2>【兔男×猫娘 OC】</H2>
        <IndentP>是美梦吗？她不能确信。或许吧，毕竟这么多年过来，两人一直陪伴在彼此身边。他们很少争吵，连交谈都是有节制地、彬彬有礼地——相爱吗？她说不清。是爱着的吧，不然她不会在他身边睡得如此安然。作为冒险者，时刻要对外界保持警惕，她很少安睡。但在他身边却不一样。让她惊异的是，有时候半夜醒来，看到身边他入睡的模样，她甚至会偷偷亲吻他的面庞。那到底是出于什么样的心情？她说不清，也从未让他知晓过。</IndentP>
        <IndentP>——无所谓了，她想，无论是不是美梦，总归都要结束了。</IndentP>
        <H2>【兔男×猫娘 OC】</H2>
        <IndentP>
            遥不敢面对他，又无处可逃，只能把脸埋进他胸前，闷声问道：“哥哥大人……喜欢我的礼物吗？”
        </IndentP>
        <IndentP>
            弥微微一愣，不由地轻笑出声。
        </IndentP>
        <IndentP> “我早就收到过最好的命名日礼物了，你知道吗？”他抚摸着她的后背道，“八年前，你钻进我帐篷的那一刻，那就是十二神赐给我最大的奇迹。是无可替代的礼物。”
        </IndentP>
        <IndentP>遥没有回话，也没有动。只是没过一会儿，就从弥的胸前传来了小小的，抽着鼻子的泣音。</IndentP>
        <IndentP>
            回应她的是一个坚定而结实的拥抱。
        </IndentP>
        <IndentP>
            “命名日快乐。”他在她耳边说。
        </IndentP>
        <H2>【希斯拉德梦向】</H2>
        <IndentP>纷乱的回忆逐渐连成一出清晰的剧目，所有的细节此刻一览无余地展现在伊利西亚面前。在厄尔庇斯，在她不曾注意的那些时刻，他也曾对她施以注视。看穿一切的瞳眸早就轻易地看透了女孩的心思，但聪慧如他从一开始就对她注定的离去早有设想，因此从未点破分毫。她是如此特别，又是如此熟悉。他越来越长久地凝视着她，几乎总是要看到无望才罢休。尽管他的生命是如此漫长，长到几乎可以将她忽略不计。可她不知道的是，曾有那么一段时光，那双能看到灵魂颜色的眼睛始终只注视着同一个人。</IndentP>
        <IndentP>在她踏上最终的旅途之前，他也最后一次凝望着她的面庞。在她将真意展现在自己面前时，选择了轻巧地规避。为了让她能够毫不动摇地走完这趟旅程，这是他所下的判断。</IndentP>
        <IndentP>而后，无论如何，他都会在这段旅程的终点等候着她。如果她没有来，那再好不过了，说明她安然无恙地赢得了最后的战斗，在人群簇拥下，成为了当之无愧的大英雄。</IndentP>
        <IndentP>而如果她真的来了……那么，自己将用这剩余下的灵魂的碎片，将她的灵魂修补完整，送她回到她应该去的地方。最终她依然会在人群簇拥下，成为当之无愧的大英雄。</IndentP>
        <IndentP>这样就好了。</IndentP>

        <H2>【兔男×猫男 OC】</H2>
        <IndentP>嘶——</IndentP>
        <IndentP>疼痛后知后觉地传来，尤塞西斯才意识到，袁野的尖牙咬在了他的肩膀，咬穿了睡衣，鲜血的味道清晰可辨，不多时就浸透了肩膀那一小片。</IndentP>
        <IndentP>在他晃神的两秒内，袁野敏捷地爬起来，披上毛毯就准备朝门外跑。他几乎没有犹豫，一步跨上前去，拦腰抱住袁野将他摔回了床上。袁野还在试图起身，但尤塞西斯的耐心已经耗尽了，他抓住袁野的手腕，将他牢牢压在身下。</IndentP>
        <IndentP>“别动！”</IndentP>
        <IndentP>尤塞西斯难得地表现出了显而易见的愤怒。</IndentP>

        <H2>【秘术双子OC】</H2>
        <IndentP>那是海特·弗莱尔不到十岁时的记忆。</IndentP>
        <IndentP>无穷无尽的雪原上，母亲最后一次将他抱在怀中，颤抖的唇齿间吐露出依旧温柔的话语。</IndentP>
        <IndentP>“海特，你……一定要守护好弟弟，和这片土地哦……”</IndentP>
        <IndentP>风雪俱寂，海特突然觉得自己什么都听不见了。鲜血从母亲的嘴角流下，一滴滴打落雪地，留下刺目的红。她再也支撑不住，身姿摇晃起来，海特反抱住了她，泪水很快结成了两道冰痕。母亲尝试着抬手去抚摸他的面庞，但那只手在半路便匆匆落下，母亲眼里最后的光也跟着一并落下。</IndentP>
        <IndentP>那是海特·弗莱尔不到十岁时的记忆——</IndentP>
        <IndentP>被染成鲜红的雪地，母亲迅速消散的体温，和她最后留下的那句，宛如诅咒的话语。</IndentP>

        <H2>【赫尔墨斯梦向】</H2>
        <IndentP>巨大的寒意笼罩了斯诺伊卡，她猛然意识到，这原来是一场葬礼。</IndentP>
        <IndentP>根本没有人对此感到悲伤……完成使命，回归星海，是他们心中的至善至美之事。甚至有不少学生略带兴奋地表示自己也向往着这一天的到来……</IndentP>
        <IndentP>生命的重量被“完成使命”轻飘飘揭过，生命的逝去无人觉得惋惜。“死”。他们似乎绝口不提这个字眼。</IndentP>
        <IndentP>来客们走上前围在老者身边向他道贺，黑色的潮水将斯诺伊卡淹没。一切声音都变得遥远而模糊，四周那些相似的人们突然扭曲成了格外高大的黑影，每一个都戴着刻出笑容的面具。斯诺伊卡几乎要喘不过气来。窒息前，她抓住了赫尔墨斯。</IndentP>
        <IndentP>那只手有力地回应了她，抓紧她，一把将她拉出了漆黑的漩涡。斯诺伊卡像一只被拉扯着的人偶，无力地随着他怀中的厄尔庇斯花一同跌落，散开满地死寂的纯白。</IndentP>
        <IndentP>风雪俱寂，海特突然觉得自己什么都听不见了。鲜血从母亲的嘴角流下，一滴滴打落雪地，留下刺目的红。她再也支撑不住，身姿摇晃起来，海特反抱住了她，泪水很快结成了两道冰痕。母亲尝试着抬手去抚摸他的面庞，但那只手在半路便匆匆落下，母亲眼里最后的光也跟着一并落下。</IndentP>

        <H2>【其他乱七八糟的坑相关】</H2>

        <IndentP>虽然从言行看出最近以来他一直为某件事所困扰着，但她却不知道该怎么发问。一直以来，她非常努力地想要连接上月永的电波，可最近电波的频率却又悄悄地改变了。</IndentP>
        <IndentP>喜欢。</IndentP>
        <IndentP>喜欢前辈。</IndentP>
        <IndentP>无论见没见到，还是每一天都在增长的思念。</IndentP>
        <IndentP>已经不知道缘由，不知道尽头，不知道要怎么办了。</IndentP>
        <IndentP>隔着樱花车窗，失神而流下眼泪的少女，朝这个号码发送了信息：</IndentP>
        <IndentP>“前辈，明天如果还能在学校见到的话，和我交往吧。”</IndentP>
        <SplitHorizontai/>
        <IndentP>萤还没来得及说些什么，凛月已经睡着了，蓬松的黑发遮住些许面庞，略显妖异的红色眼瞳闭上之后倒是线条柔和。他一直有一张毫无防备的睡颜，与平日里那疏离的神色判若两人，萤拿他毫无办法。</IndentP>
        <IndentP>一秒入睡到底是怎么做到的啊。</IndentP>
        <IndentP>虽然今日阳光灿烂，但毕竟还是三月的光景。凛月像是不知道冷似的，只穿着一件薄薄的衬衫。萤尝试着碰了碰他的鼻尖，冰凉冰凉。</IndentP>
        <IndentP>好像自己养的一只猫。</IndentP>

        <SplitHorizontai/>

        <IndentP>雨声中，momochi露出不可思议的表情来。</IndentP>
        <IndentP>“你在说什么啊……？瑞亚，我可是为你着想。分开后会无法生活的，是你吧？……因为，有很多人爱着我。可是你一旦离开了我，就不会有人爱你了啊，你明白的吧？”</IndentP>
        <IndentP>恰恰那天门没锁。瑞亚推开他冲出屋外，消失在了大雨中。</IndentP>
        <IndentP>她找了家餐厅打工，和一同打工的女孩们合住在一间公寓里。过往的日子如梦似幻——有时她又会觉得，现在的宿舍生活才是在做梦。</IndentP>
        <IndentP>原来离开他是件如此简单的事……为什么自己从前却从来没有发觉呢？</IndentP>
        <IndentP>她不知道momochi有没有找她，就这么过了一周几乎与世隔绝的生活。然而在听到他声音的那一刻，她立刻明白了，她会回到他身边。</IndentP>
        <IndentP>“没有我的话……他是活不下去的。”</IndentP>

        <SplitHorizontai/>

        <IndentP>“乔一帆！”</IndentP>
        <IndentP>他一边跑一边大声喊出了少年的名字，声音像是一只清越的飞鸟撕裂层层阴霾抵达被呼唤者的耳畔。乔一帆站住了，回身望向他，神情有一点点惊讶。高英杰也终于跑到了他身旁，伸手扶了把他的肩膀大口喘着气，他实在是不太擅长运动。</IndentP>
        <IndentP>“你……你……”</IndentP>
        <IndentP>连说了两个人称代词之后，高英杰忽然觉得大脑一片空白。</IndentP>
        <IndentP>你为什么丢下我就走？你为什么不为我解围？你为什么不和他们说话？</IndentP>
        <IndentP>你为什么那么孤独？</IndentP>
        <IndentP>……可是自己又是凭什么发问？</IndentP>

    </div>
}
